In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('state_data.csv')
print(df)
print(df.shape)

   state   latitude   longitude                  name
0     AK  63.588753 -154.493062                Alaska
1     AL  32.318231  -86.902298               Alabama
2     AR  35.201050  -91.831833              Arkansas
3     AZ  34.048928 -111.093731               Arizona
4     CA  36.778261 -119.417932            California
5     CO  39.550051 -105.782067              Colorado
6     CT  41.603221  -73.087749           Connecticut
7     DC  38.905985  -77.033418  District of Columbia
8     DE  38.910832  -75.527670              Delaware
9     FL  27.664827  -81.515754               Florida
10    GA  32.157435  -82.907123               Georgia
11    HI  19.898682 -155.665857                Hawaii
12    IA  41.878003  -93.097702                  Iowa
13    ID  44.068202 -114.742041                 Idaho
14    IL  40.633125  -89.398528              Illinois
15    IN  40.551217  -85.602364               Indiana
16    KS  39.011902  -98.484246                Kansas
17    KY  37.839333  -84.270018              Kentucky
18    LA  31.244823  -92.145024             Louisiana
19    MA  42.407211  -71.382437         Massachusetts
20    MD  39.045755  -76.641271              Maryland
21    ME  45.253783  -69.445469                 Maine
22    MI  44.314844  -85.602364              Michigan
23    MN  46.729553  -94.685900             Minnesota
24    MO  37.964253  -91.831833              Missouri
25    MS  32.354668  -89.398528           Mississippi
26    MT  46.879682 -110.362566               Montana
27    NC  35.759573  -79.019300        North Carolina
28    ND  47.551493 -101.002012          North Dakota
29    NE  41.492537  -99.901813              Nebraska
30    NH  43.193852  -71.572395         New Hampshire
31    NJ  40.058324  -74.405661            New Jersey
32    NM  34.972730 -105.032363            New Mexico
33    NV  38.802610 -116.419389                Nevada
34    NY  43.299428  -74.217933              New York
35    OH  40.417287  -82.907123                  Ohio
36    OK  35.007752  -97.092877              Oklahoma
37    OR  43.804133 -120.554201                Oregon
38    PA  41.203322  -77.194525          Pennsylvania
39    PR  18.220833  -66.590149           Puerto Rico
40    RI  41.580095  -71.477429          Rhode Island
41    SC  33.836081  -81.163725        South Carolina
42    SD  43.969515  -99.901813          South Dakota
43    TN  35.517491  -86.580447             Tennessee
44    TX  31.968599  -99.901813                 Texas
45    UT  39.320980 -111.093731                  Utah
46    VA  37.431573  -78.656894              Virginia
47    VT  44.558803  -72.577841               Vermont
48    WA  47.751074 -120.740139            Washington
49    WI  43.784440  -88.787868             Wisconsin
50    WV  38.597626  -80.454903         West Virginia
51    WY  43.075968 -107.290284               Wyoming
(52, 4)

In [4]:
#4 columns and 52 rows

In [5]:
print(df.head())

  state   latitude   longitude        name
0    AK  63.588753 -154.493062      Alaska
1    AL  32.318231  -86.902298     Alabama
2    AR  35.201050  -91.831833    Arkansas
3    AZ  34.048928 -111.093731     Arizona
4    CA  36.778261 -119.417932  California

In [6]:
print(df.tail())

   state   latitude   longitude           name
47    VT  44.558803  -72.577841        Vermont
48    WA  47.751074 -120.740139     Washington
49    WI  43.784440  -88.787868      Wisconsin
50    WV  38.597626  -80.454903  West Virginia
51    WY  43.075968 -107.290284        Wyoming

In [7]:
# #the columms are the different categorize.
# the first state is alaska
# the last state is wyoming
# there are 52 entries total
# there is more than 50 because there is probably a duplicate

In [8]:
df['latitude'].median()

39.4355155

In [9]:
df['longitude'].median()

-89.093198

In [10]:
median_latitude=df['latitude'].median()
df['absolute_distance_to_median_latitude']= (df['latitude']-median_latitude).abs()
df.head()
#I dont know why its making two coloumns

,state,latitude,longitude,name,absolute_distance_to_median_latitude
0,AK,63.588753,-154.493062,Alaska,24.153237
1,AL,32.318231,-86.902298,Alabama,7.117285
2,AR,35.201050,-91.831833,Arkansas,4.234465
3,AZ,34.048928,-111.093731,Arizona,5.386588
4,CA,36.778261,-119.417932,California,2.657255

In [11]:
median_longitude=df['longitude'].median()
df['absolute_distance_to_median_longitude']= (df['longitude']-median_longitude).abs()
df.head()

,state,latitude,longitude,name,absolute_distance_to_median_latitude,absolute_distance_to_median_longitude
0,AK,63.588753,-154.493062,Alaska,24.153237,65.399864
1,AL,32.318231,-86.902298,Alabama,7.117285,2.190900
2,AR,35.201050,-91.831833,Arkansas,4.234465,2.738635
3,AZ,34.048928,-111.093731,Arizona,5.386588,22.000533
4,CA,36.778261,-119.417932,California,2.657255,30.324734

In [12]:
df.shape
#52 rows and 7 columns

(52, 6)

In [29]:
closest_latitude=df.loc[df['absolute_distance_to_median_latitude'].idxmin()]
print(closest_latitude)
print(f"{closest_latitude['absolute_distance_to_median_latitude']:.2f}")

state                                            CO
latitude                                  39.550051
longitude                               -105.782067
name                                       Colorado
absolute_distance_to_median_latitude       0.114536
absolute_distance_to_median_longitude     16.688869
Name: 5, dtype: object
0.11

In [30]:
farthest_latitude=df.loc[df['absolute_distance_to_median_latitude'].idxmax()]
print(farthest_latitude)
print(f"{farthest_latitude['absolute_distance_to_median_latitude']:.2f}")

state                                            AK
latitude                                  63.588753
longitude                               -154.493062
name                                         Alaska
absolute_distance_to_median_latitude      24.153237
absolute_distance_to_median_longitude     65.399864
Name: 0, dtype: object
24.15

In [31]:
closest_longitude=df.loc[df['absolute_distance_to_median_longitude'].idxmin()]
print(closest_longitude)
print(f"{closest_longitude['absolute_distance_to_median_longitude']:.2f}")

state                                           IL
latitude                                 40.633125
longitude                               -89.398528
name                                      Illinois
absolute_distance_to_median_latitude      1.197609
absolute_distance_to_median_longitude      0.30533
Name: 14, dtype: object
0.31

In [32]:
farthest_longitude=df.loc[df['absolute_distance_to_median_longitude'].idxmax()]
print(farthest_longitude)
print(f"{farthest_longitude['absolute_distance_to_median_longitude']:.2f}")

state                                            HI
latitude                                  19.898682
longitude                               -155.665857
name                                         Hawaii
absolute_distance_to_median_latitude      19.536834
absolute_distance_to_median_longitude     66.572659
Name: 11, dtype: object
66.57

In [ ]:
# using pandas.pivot
df.pivot(index='state', columns='latitude', values='names')